In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [6]:
df

                   A         B         C         D
2013-01-01  0.813399  0.562514  0.840285 -0.303228
2013-01-02 -0.620399  0.350548  0.004386  0.248320
2013-01-03 -0.288518 -1.904786 -2.179893 -0.484495
2013-01-04  1.689702 -1.703145  1.612877 -0.860718
2013-01-05 -0.416485 -1.609066 -0.866957  0.856773
2013-01-06  1.089825  0.032371  1.317983  0.001747

In [7]:
df = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [9]:
df.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df.tail(1)

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df.index

Index([0, 1, 2, 3], dtype='int64')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [13]:
df.to_numpy().dtype

dtype('O')

In [14]:
df.to_numpy().dtype # object => as it fits all

dtype('O')

In [15]:
df.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [16]:
df.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [17]:
df.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [18]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [19]:
df.sort_index(ascending=False)

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-02  1.0  3   test  foo

In [20]:
df.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [21]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [22]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-03  0.271573 -0.358834  1.475016 -1.107659
2013-01-04 -0.882402  0.211132  1.528173 -0.943440
2013-01-05  0.445173  0.753380  0.335725 -1.604177
2013-01-06  1.423606  0.452894 -0.489126  0.017875

In [23]:
df.sort_values("B")

                   A         B         C         D
2013-01-03  0.271573 -0.358834  1.475016 -1.107659
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-04 -0.882402  0.211132  1.528173 -0.943440
2013-01-06  1.423606  0.452894 -0.489126  0.017875
2013-01-05  0.445173  0.753380  0.335725 -1.604177

In [24]:
df["A"]

2013-01-01    1.329452
2013-01-02   -0.309988
2013-01-03    0.271573
2013-01-04   -0.882402
2013-01-05    0.445173
2013-01-06    1.423606
Freq: D, Name: A, dtype: float64

In [25]:
type(df["A"])

pandas.core.series.Series

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-03  0.271573 -0.358834  1.475016 -1.107659

In [27]:
df["20130101":"20130103"]

                   A         B         C         D
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-03  0.271573 -0.358834  1.475016 -1.107659

In [28]:
df.loc["20130103"]

A    0.271573
B   -0.358834
C    1.475016
D   -1.107659
Name: 2013-01-03 00:00:00, dtype: float64

In [29]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.329452  0.075246
2013-01-02 -0.309988 -0.031991
2013-01-03  0.271573 -0.358834
2013-01-04 -0.882402  0.211132
2013-01-05  0.445173  0.753380
2013-01-06  1.423606  0.452894

In [30]:
df.loc["20130102":"20130104", "A": "B"]

                   A         B
2013-01-02 -0.309988 -0.031991
2013-01-03  0.271573 -0.358834
2013-01-04 -0.882402  0.211132

In [31]:
df.at[dates[0], "A"]

np.float64(1.3294523736080044)

In [32]:
df.iloc[3]

A   -0.882402
B    0.211132
C    1.528173
D   -0.943440
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df

                   A         B         C         D
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-03  0.271573 -0.358834  1.475016 -1.107659
2013-01-04 -0.882402  0.211132  1.528173 -0.943440
2013-01-05  0.445173  0.753380  0.335725 -1.604177
2013-01-06  1.423606  0.452894 -0.489126  0.017875

In [34]:
df.iloc[3:5]

                   A         B         C         D
2013-01-04 -0.882402  0.211132  1.528173 -0.943440
2013-01-05  0.445173  0.753380  0.335725 -1.604177

In [35]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.882402  0.211132
2013-01-05  0.445173  0.753380

In [36]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.309988  1.091681
2013-01-03  0.271573  1.475016
2013-01-05  0.445173  0.335725

In [37]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-03  0.271573 -0.358834  1.475016 -1.107659

In [38]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.075246 -0.057852
2013-01-02 -0.031991  1.091681
2013-01-03 -0.358834  1.475016
2013-01-04  0.211132  1.528173
2013-01-05  0.753380  0.335725
2013-01-06  0.452894 -0.489126

In [39]:
df.iloc[1, 1]

np.float64(-0.03199089039035163)

In [40]:
df.iat[1, 1]

np.float64(-0.03199089039035163)

In [42]:
df.at[dates[0], "A"]

np.float64(1.3294523736080044)

In [43]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-03  0.271573 -0.358834  1.475016 -1.107659
2013-01-05  0.445173  0.753380  0.335725 -1.604177
2013-01-06  1.423606  0.452894 -0.489126  0.017875

In [44]:
df["A"] > 0

2013-01-01     True
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

In [45]:
df > 0

                A      B      C      D
2013-01-01   True   True  False  False
2013-01-02  False  False   True   True
2013-01-03   True  False   True  False
2013-01-04  False   True   True  False
2013-01-05   True   True   True  False
2013-01-06   True   True  False   True

In [46]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.329452  0.075246       NaN       NaN
2013-01-02       NaN       NaN  1.091681  1.115255
2013-01-03  0.271573       NaN  1.475016       NaN
2013-01-04       NaN  0.211132  1.528173       NaN
2013-01-05  0.445173  0.753380  0.335725       NaN
2013-01-06  1.423606  0.452894       NaN  0.017875

In [47]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [48]:
df2

                   A         B         C         D      E
2013-01-01  1.329452  0.075246 -0.057852 -0.730614    one
2013-01-02 -0.309988 -0.031991  1.091681  1.115255    one
2013-01-03  0.271573 -0.358834  1.475016 -1.107659    two
2013-01-04 -0.882402  0.211132  1.528173 -0.943440  three
2013-01-05  0.445173  0.753380  0.335725 -1.604177   four
2013-01-06  1.423606  0.452894 -0.489126  0.017875  three

In [49]:
df

                   A         B         C         D
2013-01-01  1.329452  0.075246 -0.057852 -0.730614
2013-01-02 -0.309988 -0.031991  1.091681  1.115255
2013-01-03  0.271573 -0.358834  1.475016 -1.107659
2013-01-04 -0.882402  0.211132  1.528173 -0.943440
2013-01-05  0.445173  0.753380  0.335725 -1.604177
2013-01-06  1.423606  0.452894 -0.489126  0.017875

In [50]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.271573 -0.358834  1.475016 -1.107659   two
2013-01-05  0.445173  0.753380  0.335725 -1.604177  four

In [51]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [52]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [53]:
df.at[dates[0], "A"]

np.float64(1.3294523736080044)

In [54]:
df.at[dates[0], "A"] = 0

In [56]:
df.iat[0, 1] = 0

In [57]:
df.loc[:, "D"] = np.array([5] * len(df))

In [58]:
df

                   A         B         C    D
2013-01-01  0.000000  0.000000 -0.057852  5.0
2013-01-02 -0.309988 -0.031991  1.091681  5.0
2013-01-03  0.271573 -0.358834  1.475016  5.0
2013-01-04 -0.882402  0.211132  1.528173  5.0
2013-01-05  0.445173  0.753380  0.335725  5.0
2013-01-06  1.423606  0.452894 -0.489126  5.0

In [59]:
df["F"] = s1

In [60]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.057852  5.0  NaN
2013-01-02 -0.309988 -0.031991  1.091681  5.0  1.0
2013-01-03  0.271573 -0.358834  1.475016  5.0  2.0
2013-01-04 -0.882402  0.211132  1.528173  5.0  3.0
2013-01-05  0.445173  0.753380  0.335725  5.0  4.0
2013-01-06  1.423606  0.452894 -0.489126  5.0  5.0

In [61]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.057852 -5.0  NaN
2013-01-02 -0.309988 -0.031991 -1.091681 -5.0 -1.0
2013-01-03 -0.271573 -0.358834 -1.475016 -5.0 -2.0
2013-01-04 -0.882402 -0.211132 -1.528173 -5.0 -3.0
2013-01-05 -0.445173 -0.753380 -0.335725 -5.0 -4.0
2013-01-06 -1.423606 -0.452894 -0.489126 -5.0 -5.0

In [62]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["e"])
df1

                   A         B         C    D    F   e
2013-01-01  0.000000  0.000000 -0.057852  5.0  NaN NaN
2013-01-02 -0.309988 -0.031991  1.091681  5.0  1.0 NaN
2013-01-03  0.271573 -0.358834  1.475016  5.0  2.0 NaN
2013-01-04 -0.882402  0.211132  1.528173  5.0  3.0 NaN

In [63]:
df1.loc[dates[0]: dates[1], "E"] = 1
df1

                   A         B         C    D    F   e    E
2013-01-01  0.000000  0.000000 -0.057852  5.0  NaN NaN  1.0
2013-01-02 -0.309988 -0.031991  1.091681  5.0  1.0 NaN  1.0
2013-01-03  0.271573 -0.358834  1.475016  5.0  2.0 NaN  NaN
2013-01-04 -0.882402  0.211132  1.528173  5.0  3.0 NaN  NaN

In [65]:
df1.loc[dates[0]: dates[1], "E"] = 2

In [66]:
df1

                   A         B         C    D    F   e    E
2013-01-01  0.000000  0.000000 -0.057852  5.0  NaN NaN  2.0
2013-01-02 -0.309988 -0.031991  1.091681  5.0  1.0 NaN  2.0
2013-01-03  0.271573 -0.358834  1.475016  5.0  2.0 NaN  NaN
2013-01-04 -0.882402  0.211132  1.528173  5.0  3.0 NaN  NaN

In [67]:
df1.dropna()

Empty DataFrame
Columns: [A, B, C, D, F, e, E]
Index: []

In [69]:
df1.fillna(value=5)

                   A         B         C    D    F    e    E
2013-01-01  0.000000  0.000000 -0.057852  5.0  5.0  5.0  2.0
2013-01-02 -0.309988 -0.031991  1.091681  5.0  1.0  5.0  2.0
2013-01-03  0.271573 -0.358834  1.475016  5.0  2.0  5.0  5.0
2013-01-04 -0.882402  0.211132  1.528173  5.0  3.0  5.0  5.0

In [70]:
pd.isna(df1)

                A      B      C      D      F     e      E
2013-01-01  False  False  False  False   True  True  False
2013-01-02  False  False  False  False  False  True  False
2013-01-03  False  False  False  False  False  True   True
2013-01-04  False  False  False  False  False  True   True

In [71]:
df

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -0.057852  5.0  NaN  2.0
2013-01-02 -0.309988 -0.031991  1.091681  5.0  1.0  2.0
2013-01-03  0.271573 -0.358834  1.475016  5.0  2.0  NaN
2013-01-04 -0.882402  0.211132  1.528173  5.0  3.0  NaN
2013-01-05  0.445173  0.753380  0.335725  5.0  4.0  NaN
2013-01-06  1.423606  0.452894 -0.489126  5.0  5.0  NaN

In [72]:
df.mean()

A    0.157994
B    0.171097
C    0.647269
D    5.000000
F    3.000000
E    2.000000
dtype: float64

In [73]:
df.mean(axis=1)

2013-01-01    1.388430
2013-01-02    1.458284
2013-01-03    1.677551
2013-01-04    1.771380
2013-01-05    2.106855
2013-01-06    2.277475
Freq: D, dtype: float64

In [75]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [76]:
df.sub(s, axis="index")

                   A         B         C    D    F   E
2013-01-01       NaN       NaN       NaN  NaN  NaN NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN NaN
2013-01-03 -0.728427 -1.358834  0.475016  4.0  1.0 NaN
2013-01-04 -3.882402 -2.788868 -1.471827  2.0  0.0 NaN
2013-01-05 -4.554827 -4.246620 -4.664275  0.0 -1.0 NaN
2013-01-06       NaN       NaN       NaN  NaN  NaN NaN

In [77]:
df.agg(lambda x: np.mean(x) * 5.6)

A     0.884764
B     0.958142
C     3.624708
D    28.000000
F    16.800000
E    11.200000
dtype: float64

In [78]:
df.transform(lambda x: x * 101.2)

                     A          B           C      D      F      E
2013-01-01    0.000000   0.000000   -5.854578  506.0    NaN  202.4
2013-01-02  -31.370782  -3.237478  110.478082  506.0  101.2  202.4
2013-01-03   27.483160 -36.313968  149.271617  506.0  202.4    NaN
2013-01-04  -89.299117  21.366521  154.651059  506.0  303.6    NaN
2013-01-05   45.051521  76.242012   33.975341  506.0  404.8    NaN
2013-01-06  144.068944  45.832877  -49.499576  506.0  506.0    NaN

In [79]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [80]:
s

0    3
1    0
2    5
3    1
4    3
5    6
6    3
7    1
8    3
9    1
dtype: int64

In [81]:
s.value_counts()

3    4
1    3
0    1
5    1
6    1
Name: count, dtype: int64

In [82]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [7]:
a = np.random.randn(10, 4)
b = np.random.randn(10, 4)

In [8]:
np.hstack((a, b)).shape

(10, 8)

In [9]:
np.vstack((a, b)).shape

(20, 4)

In [10]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.344395 -1.387017 -0.398701  2.308154
1  0.409964  0.283042  0.868013  0.769581
2 -1.814412 -0.339916 -0.698728 -0.193310
3  0.266749 -1.271420 -0.299521 -0.081225
4 -0.384886  1.276187  1.085594 -1.110575
5 -0.397431 -0.870910  0.093963  1.476707
6 -0.359658 -0.114765 -1.898964 -1.031023
7 -0.205223 -0.223611  2.292279 -0.489503
8 -0.102911  0.533961  2.527238 -1.415412
9 -0.368259 -1.010729  0.989205  0.711115

In [11]:
pieces = [df[:3], df[3:7], df[7:]]

In [12]:
pieces

[          0         1         2         3
 0  0.344395 -1.387017 -0.398701  2.308154
 1  0.409964  0.283042  0.868013  0.769581
 2 -1.814412 -0.339916 -0.698728 -0.193310,
           0         1         2         3
 3  0.266749 -1.271420 -0.299521 -0.081225
 4 -0.384886  1.276187  1.085594 -1.110575
 5 -0.397431 -0.870910  0.093963  1.476707
 6 -0.359658 -0.114765 -1.898964 -1.031023,
           0         1         2         3
 7 -0.205223 -0.223611  2.292279 -0.489503
 8 -0.102911  0.533961  2.527238 -1.415412
 9 -0.368259 -1.010729  0.989205  0.711115]

In [13]:
pd.concat(pieces)

          0         1         2         3
0  0.344395 -1.387017 -0.398701  2.308154
1  0.409964  0.283042  0.868013  0.769581
2 -1.814412 -0.339916 -0.698728 -0.193310
3  0.266749 -1.271420 -0.299521 -0.081225
4 -0.384886  1.276187  1.085594 -1.110575
5 -0.397431 -0.870910  0.093963  1.476707
6 -0.359658 -0.114765 -1.898964 -1.031023
7 -0.205223 -0.223611  2.292279 -0.489503
8 -0.102911  0.533961  2.527238 -1.415412
9 -0.368259 -1.010729  0.989205  0.711115

In [14]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [3, 4]})

In [15]:
left

   key  lval
0  foo     1
1  foo     2

In [16]:
right

   key  rval
0  foo     3
1  foo     4

In [17]:
pd.merge(left, right, on="key") # sql join

   key  lval  rval
0  foo     1     3
1  foo     1     4
2  foo     2     3
3  foo     2     4

In [18]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [19]:
left

   key  lval
0  foo     1
1  bar     2

In [20]:
right

   key  rval
0  foo     4
1  bar     5

In [21]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Grouping

In [22]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one -0.317660 -2.619513
1  bar    one  0.803273  0.203080
2  foo    two -0.465930  1.113852
3  bar  three  1.118896 -0.902103
4  foo    two -1.186737  0.617464
5  bar    two -0.977010  0.363150
6  foo    one  1.119197  0.732951
7  foo  three  0.540966 -2.245091

In [25]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.945159 -0.335873
foo -0.310164 -2.400337

In [26]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.803273  0.203080
    three  1.118896 -0.902103
    two   -0.977010  0.363150
foo one    0.801537 -1.886562
    three  0.540966 -2.245091
    two   -1.652667  1.731316

## Reshaping

### Stack

In [27]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [28]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df

                     A         B
first second
bar   one    -1.133865  1.433558
      two    -1.814774 -1.111128
baz   one    -0.928509 -0.450601
      two     0.857130 -0.298480
foo   one    -1.019487  2.054922
      two    -0.740854  0.439087
qux   one    -1.393106  0.730321
      two     0.970494  1.108231

In [29]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -1.133865  1.433558
      two    -1.814774 -1.111128
baz   one    -0.928509 -0.450601
      two     0.857130 -0.298480

In [30]:
stacked = df2.stack(future_stack=True)
stacked

first  second
bar    one     A   -1.133865
               B    1.433558
       two     A   -1.814774
               B   -1.111128
baz    one     A   -0.928509
               B   -0.450601
       two     A    0.857130
               B   -0.298480
dtype: float64

In [31]:
stacked.unstack()

                     A         B
first second
bar   one    -1.133865  1.433558
      two    -1.814774 -1.111128
baz   one    -0.928509 -0.450601
      two     0.857130 -0.298480

In [33]:
stacked

first  second
bar    one     A   -1.133865
               B    1.433558
       two     A   -1.814774
               B   -1.111128
baz    one     A   -0.928509
               B   -0.450601
       two     A    0.857130
               B   -0.298480
dtype: float64

In [32]:
stacked.unstack(1)

second        one       two
first
bar   A -1.133865 -1.814774
      B  1.433558 -1.111128
baz   A -0.928509  0.857130
      B -0.450601 -0.298480

In [34]:
stacked

first  second
bar    one     A   -1.133865
               B    1.433558
       two     A   -1.814774
               B   -1.111128
baz    one     A   -0.928509
               B   -0.450601
       two     A    0.857130
               B   -0.298480
dtype: float64

In [35]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.133865 -0.928509
       B  1.433558 -0.450601
two    A -1.814774  0.857130
       B -1.111128 -0.298480